In [3]:
import pandas as pd
import numpy as np

df= pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['name','id','sex'])
df

   name  id  sex
a     0   1    2
b     3   4    5
c     6   7    8

# 重新索引

In [4]:
# 重新索引行

df2=df.reindex(['a','b','c','d'])
df2

   name   id  sex
a   0.0  1.0  2.0
b   3.0  4.0  5.0
c   6.0  7.0  8.0
d   NaN  NaN  NaN

In [5]:
# 重新索引列
# fill_value：缺失值替代值

df3 = df.reindex(columns=['name','year','id'],fill_value=0)
df3

   name  year  id
a     0     0   1
b     3     0   4
c     6     0   7

# 更换索引

In [9]:
# 将列数据设置为索引

data= {
    'name':['张三','李四','王五'],
    'sex':['male','female','male'],
    'year':[24,37,33],
    'city':['天津','深圳','北京']
}

df4 = pd.DataFrame(data)

df5=df4.set_index('name')
df5

         sex  year city
name
张三      male    24   天津
李四    female    37   深圳
王五      male    33   北京

In [11]:
df6 = df5.sort_values('year')
df6

         sex  year city
name
张三      male    24   天津
王五      male    33   北京
李四    female    37   深圳

# 数据的选取

## 选取列

In [16]:
df5.city

name
张三    天津
李四    深圳
王五    北京
Name: city, dtype: object

In [14]:
df5['sex']

name
张三      male
李四    female
王五      male
Name: sex, dtype: object

In [15]:
df5[['sex','year']]

         sex  year
name
张三      male    24
李四    female    37
王五      male    33

## 选取行

In [17]:
df5[0:2]

         sex  year city
name
张三      male    24   天津
李四    female    37   深圳

In [18]:
df5['张三':'王五']

         sex  year city
name
张三      male    24   天津
李四    female    37   深圳
王五      male    33   北京